tsung_scritps/tsung_auth_login.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="notice">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="ziqi.eba-wqi6mj7g.us-west-2.elasticbeanstalk.com" port="80" type="tcp" />
  </servers>

  <load>
    <!-- Phase 1 -->
    <arrivalphase phase="1" duration="20" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <!-- Phase 2 -->
    <arrivalphase phase="2" duration="20" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <!-- Phase 3 -->
    <arrivalphase phase="3" duration="20" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <!-- Phase 4 -->
    <arrivalphase phase="4" duration="60" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <!-- Phase 5 -->
    <arrivalphase phase="5" duration="60" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="60" unit="second">
      <users arrivalrate="128" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 2 seconds -->
    <option name="global_ack_timeout" value="2000"></option>
  </options>

  <sessions>
    <session name="register-login-logout" type="ts_http" weight="1">
      <setdynvars sourcetype="random_string" length="20">
        <var name="rand_str1" />
      </setdynvars>

      <request>
        <dyn_variable name="user_id" jsonpath="$.user.id"/>
        <http url="/api/signup" method="POST" version="1.1" contents="username=user_%%_rand_str1%%;password=w12345678;password_confirmation=w12345678;"></http>
      </request>
      <thinktime value="2" random="true"></thinktime>
      
      <request><http url="/api/login" method="POST" version="1.1" contents="username=user_%%_rand_str%%;password=w12345678;"></http></request>
      <thinktime value="2" random="true"></thinktime>

      <request><http url="/api/logout" method="DELETE" version="1.1" contents="user_id=%%_user_id%%"></http></request>
    </session>
  </sessions>
</tsung>