tsung_scritps/tsung_unauth.xml
<?xml version="1.0"?>
<!DOCTYPE tsung SYSTEM "/usr/local/share/tsung/tsung-1.0.dtd" [] >
<tsung loglevel="debug">
  <clients>
    <client host="localhost" maxusers="32768" use_controller_vm="true" />
  </clients>

  <servers>
    <server host="ziqi.eba-wqi6mj7g.us-west-2.elasticbeanstalk.com" port="80" type="tcp" />
  </servers>

  <load>
    <!-- Phase 1 -->
    <arrivalphase phase="1" duration="60" unit="second">
      <users arrivalrate="1" unit="second"></users>
    </arrivalphase>
    <!-- Phase 2 -->
    <arrivalphase phase="2" duration="60" unit="second">
      <users arrivalrate="2" unit="second"></users>
    </arrivalphase>
    <!-- Phase 3 -->
    <arrivalphase phase="3" duration="60" unit="second">
      <users arrivalrate="4" unit="second"></users>
    </arrivalphase>
    <!-- Phase 4 -->
    <arrivalphase phase="4" duration="60" unit="second">
      <users arrivalrate="8" unit="second"></users>
    </arrivalphase>
    <!-- Phase 5 -->
    <arrivalphase phase="5" duration="60" unit="second">
      <users arrivalrate="16" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="6" duration="60" unit="second">
      <users arrivalrate="32" unit="second"></users>
    </arrivalphase>
    <arrivalphase phase="7" duration="60" unit="second">
      <users arrivalrate="64" unit="second"></users>
    </arrivalphase>
  </load>

  <options>
    <!-- Set connection timeout to 8 seconds -->
    <option name="global_ack_timeout" value="8000"></option>
  </options>

  <sessions>
    <session name="register-login-logout" type="ts_http" weight="1">
      <setdynvars sourcetype="random_string" length="13">
        <var name="rand_str1" />
      </setdynvars>

      <!-- this one success -->

      <request>
        <dyn_variable name="content" jsonpath="$.content"/>
        <http url="/api/posts" method="GET" version="1.1">
        <http_header name="Content-Type" value="application/json"/>
        <http_header name="Accept" value="application/json"/>
        </http>
      </request>
      
      <request subst="true">
        <dyn_variable name="post_id" jsonpath="$.id"/>
        <http url="/api/posts" method="POST" version="1.1" contents='{&quot;content&quot;: &quot;%%_rand_str1%%&quot;}'>
        <http_header name="Content-Type" value="application/json"/>
        <http_header name="Accept" value="application/json"/>
        </http>
      </request>

      <request subst="true">
        <dyn_variable name="content" jsonpath="$.content"/>
        <http url="/api/posts/%%_post_id%%" method="GET" version="1.1">
        <http_header name="Content-Type" value="application/json"/>
        <http_header name="Accept" value="application/json"/>
        </http>
      </request>

      <thinktime value="2" random="true"></thinktime>

      <request subst="true">
        <dyn_variable name="comment_id" jsonpath="$.id"/>
        <http url="/api/posts/%%_post_id%%/comments" method="POST" version="1.1"  contents='postId=%%_post_id%%&amp;content=%%_rand_str1%%'>
        <http_header name="Content-Type" value="application/x-www-form-urlencoded"/>
        <http_header name="Accept" value="application/x-www-form-urlencoded"/>
        </http>
      </request>

      <request subst="true">
        <dyn_variable name="comment_id" jsonpath="$.id"/>
        <http url="/api/posts/%%_post_id%%/comments" method="GET" version="1.1">
        <http_header name="Content-Type" value="application/x-www-form-urlencoded"/>
        <http_header name="Accept" value="application/x-www-form-urlencoded"/>
        </http>
      </request>
      
      
    </session>
  </sessions>
</tsung>